a = int(input("Введите первое число: "))
b = int(input("Введите второе число: "))
print('1. Сложение; 2. Вычитание; 3. Умножение; 4. Деление; 5 Целочисленное деление; 6. Остаток от деления; 7.Возведение в степень')
z = input("Введите номер арифметической операции: ")
    
if z =="1":
        c = a + b
        print (f"Результат: {c}")
elif z =="2":
        c = a - b
        print (f"Результат: {c}")
elif z =="3":
        c = a * b
        print (f"Результат: {c}")
elif z =="4":
        c = a / b
        print (f"Результат: {c}")
elif z =="5":
        c = a // b
        print (f"Результат: {c}")
elif z =="6":
        c = a % b
        print (f"Результат: {c}")
elif z =="7":
        c = a ** b
        print (f"Результат: {c}")