a = int(input("Введите первое число: "))
b = int(input("Введите второе число: "))
z = input("Введите номер оператора сравнения (1. Равно; 2. Не равно; 3. Больше; 4. Меньше; 5 Больше или равно; 6. Меньше или равно): ")
c = 0
if z =="1":
        c = a == b
        print (f"Результат: {c}")
elif z =="2":
        c = a != b
        print (f"Результат: {c}")
elif z =="3":
        c = a > b
        print (f"Результат: {c}")
elif z =="4":
        c = a < b
        print (f"Результат: {c}")
elif z =="5":
        c = a >= b
        print (f"Результат: {c}")
elif z =="6":
        c = a <= b
        print (f"Результат: {c}")